In [ ]:
WHERE 절 IN 연산자 

SELECT * FROM Customers
                WHERE Country IN ('Paris', 'London');

Country가 'Paris'이거나 'London' 이면 출력

TABLE 데이터 바꾸는 작업 할 때는 pd.read_sql("",conn)으로 하면 오류남
cur.execute()로 해야 오류 안남

Insert할때 안 넣는 컬럼 값은 None(NULL)이 됨

모든 레코드 삭제할 때: DELETE FROM Customers;
테이블 삭제할 때: DROP TABLE Customers;

In [ ]:
SQL Aggregate Functions
An aggregate function is a function that performs a calculation on a set of values, and returns a single value.

Aggregate functions are often used with the GROUP BY clause of the SELECT statement. 
The GROUP BY clause splits the result-set into groups of values and the aggregate function can be used to return a single value for each group.

MIN() - returns the smallest value within the selected column
MAX() - returns the largest value within the selected column
COUNT() - returns the number of rows in a set
SUM() - returns the total sum of a numerical column
AVG() - returns the average value of a numerical column

Aggregate functions ignore null values (except for COUNT()).

In [ ]:
#날짜 관련
pd.read_sql("""SELECT * FROM Orders
                WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31';""",conn)

#Concat Columns
pd.read_sql("""SELECT CustomerName, (Address || ', ' || PostalCode || ' ' || City || ', '|| Country) AS Address
                FROM Customers;""",conn)

In [ ]:
#JOIN Three Tables  
pd.read_sql("""SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
                FROM Orders
                INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
                INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);""",conn)
세 테이블 조인할 때

In [ ]:
#'Customer'인지 'Supplier'인지 나열하는 임시 Column을 하나 만들 수 있다.
pd.read_sql("""SELECT 'Customer' AS Type, ContactName, City, Country
                FROM Customers
                UNION
                SELECT 'Supplier', ContactName, City,Country
                FROM Suppliers;""",conn)

<Having 과 where의 차이점>
having절과 where절의 유사점: 둘 다 데이터 세트검색을 필터링할때 사용할 수 있다는 점입니다.
having 절과 where절의 차이: having은 전체 결과, where은 개별 행

Having절은 WHERE절과 비슷하지만 그룹 전체 즉, 그룹을 나타내는 결과 집합의 행에만 적용된다
반면 WHERE절은 개별 행에 적용이 된다.

having은 SQL select문이 집계 값이 지정된 조건을 충족하는 행만 반환하도록 지정하는 SQL절이다.
where은 단일 테이블에서 데이터를 가져 오거나 여러 테이블과 결합하여 조건을 지정하는데 사용되는 SQL절이다.
    
having절은 그룹을 필터링하는 데 사용된다.
where절을 행을 필터링 하는데 사용된다.
    
집계 함수는 having 절과 함께 사용할 수 있다.
where절을 have절에 포함된 하위 쿼리에 있지않으면 집계함수와 함께 사용할 수 없다.
(집계함수란, COUNT, MIN, MAX, SUM, AVG등등이 있다.)
having 절은 Group By 절 뒤에 사용합니다.
Where 절은 Group By 절 앞에 사용합니다.

간단 요약
Having은 그룹화 또는 집계가 발생한 후 레코드를 필터링하는데 사용된다.
Where은 그룹화 또는 집계가 발생하기 전에 레코드를 필터링하는데 사용된다.

In [ ]:
EXISTS 사용법 잘 모르겠음,,,,

sqlite3환경에서 ANY,ALL,INTO, INSERT INTO SELECT, STORED PROCEDURE 동작 안함

In [ ]:
#CASE문
CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    WHEN conditionN THEN resultN
    ELSE result
END;

#예제
pd.read_sql("""SELECT CustomerName, City,Country
                FROM Customers
                ORDER BY
                (CASE
                    WHEN City IS NULL THEN Country
                    ELSE City
                END);""",conn)

#### 팀원들끼리 문제 만들어서 공유하기

In [14]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('Northwind.db')

In [10]:
#1997년 1월 1일 이전에 발생한 주문을 담당하는 Employee의 LastName을 출력하시오(DISTINCT 사용하기)
pd.read_sql("""SELECT DISTINCT LastName FROM Employees
                WHERE EXISTS (SELECT EmployeeID FROM Orders
                			WHERE Employees.EmployeeID = Orders.EmployeeID AND OrderDate < '1997-01-01');""",conn)

    LastName
0    Davolio
1     Fuller
2  Leverling
3    Peacock
4   Buchanan
5     Suyama
6       King
7   Callahan
8  Dodsworth

In [36]:
# Q. Orders 테이블과 Employees 테이블 이용
# 주문을 10개 이상 받은 Employee 중에서 LastName이 D나 C로 시작하는 사원들 LastName 정보 출력


pd.read_sql("""SELECT Employees.LastName FROM Employees 
                JOIN Orders ON Orders.EmployeeID = Employees.EmployeeID
                WHERE LastName LIKE 'C%' OR LastName LIKE 'D%'
                GROUP BY Employees.EmployeeID
                HAVING COUNT(Orders.OrderID) >10;
                """,conn)

   LastName
0   Davolio
1  Callahan

In [34]:
#CASE 예제
#이름에 따라 고객 그룹을 설정하여라. 고객 그룹 설정 규칙은 다음과 같다.
#● Group 1 : A ~ I로 시작하는 이름을 가지고 있는 고객.
#● Group 2 : J ~ O로 시작하는 이름을 가지고 있는 고객.
#● Group 3 : P ~ T로 시작하는 이름을 가지고 있는 고객.
#● Group 4 : U ~ Z로 시작하는 이름을  가지고 있는 고객.
#이후, 각 그룹에 고객들의 수를 구하여 이를 출력하라.
pd.read_sql("""SELECT COUNT(CustomerName), 
                CASE 
                When CustomerName Between 'A' AND 'J' THEN '1'
                WHEN CustomerName BETWEEN 'J' AND 'P' THEN '2'
                WHEN CustomerName BETWEEN 'P' AND 'U' THEN '3'
                ELSE '4'
                END AS GROUPNum
                FROM Customers 
                GROUP BY GROUPNum;""",conn)

   COUNT(CustomerName) GROUPNum
0                   39        1
1                   18        2
2                   26        3
3                    8        4